read_verilog -sv rtl/stream_arb_fifo.sv
hierarchy -top stream_arb_fifo
proc
opt
write_json reports/proc.json
synth_ice40 -top stream_arb_fifo -json reports/synth_ice40.json
